{
  "basics": {
    "name": "Matt Richards",
    "label": "Everest Implementation Expert | Software Engineering Leader",
    "email": "mtrichards26@gmail.com",
    "telephone": "",
    "summary": "Software engineering leader with 15+ years of experience designing, building, and configuring the Everest front-office platform for clients of all types and sizes in the alternative asset management space. Deep knowledge of documented and undocumented Everest architecture, particularly its integration layer. Skilled in implementing and extending Everest to meet client needs across many asset types through APIs, SFTP, S3, FIX, and other delivery mechanisms. Experienced in leading client implementations, architecting integrations with third-party systems, and training technical teams to deliver high-impact solutions. Recently contributed to the design and build of Allvue’s Data Platform (Nexius), extending expertise to modern data architecture.",
    "location": {
      "postalCode": "92130",
      "city": "San Diego",
      "region": "CA"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "mtrichards",
        "url": "https://www.linkedin.com/in/mtrichards/"
      },
      {
        "network": "GitHub",
        "username": "mtrichards26",
        "url": "https://github.com/mtrichards26"
      }
    ]
  },
  "skills": [
    {
      "name": "Allvue Platforms",
      "keywords": [
        "Everest",
        "Nexius (Data Platform)"
      ]
    },
    {
      "name": "Integrations",
      "keywords": [
        "APIs",
        "FIX",
        "SFTP",
        "S3",
        "Custom file formats"
      ]
    },
    {
      "name": "Languages & Tools",
      "keywords": [
        "C#/.NET",
        "SQL",
        "PowerShell",
        "Python",
        "XML/XSLT",
        "Snowflake",
        "AWS",
        "Azure"
      ]
    },
    {
      "name": "Focus Areas",
      "keywords": [
        "Data integration",
        "Workflow automation",
        "Reporting",
        "Client implementation support"
      ]
    }
  ],
  "education": [
    {
      "institution": "University of California San Diego",
      "url": "https://ucsd.edu",
      "area": "Political Science: International Relations",
      "studyType": "Bachelor of Arts",
      "endDate": "1999"
    }
  ],
  "work": [
    {
      "name": "Allvue Systems (formerly Black Mountain Systems)",
      "url": "https://allvuesystems.com",
      "location": "San Diego, CA",
      "position": "Director of Data Engineering / Senior Principal Architect",
      "startDate": "2020",
      "highlights": [
        "Helped design and architect the Nexius Data Platform, Allvue’s modern data and integration product.",
        "Guided engineering teams to deliver scalable data pipelines and APIs integrating Everest with external client systems.",
        "Partnered with clients and product teams to define integration requirements for Everest extensions and Allvue’s broader platform."
      ]
    },
    {
      "name": "Allvue Systems",
      "url": "https://allvuesystems.com",
      "location": "San Diego, CA",
      "position": "Director, Ops Engineering / Architect",
      "startDate": "2018",
      "endDate": "2020",
      "highlights": [
        "Led a team focused on enabling product engineering teams to deploy, manage, and integrate applications through CI/CD pipelines and internal tooling.",
        "Built internal tools that streamlined client onboarding, incident response, and operational workflows.",
        "Drove the migration to Azure DevOps and Jira, consolidating systems and improving delivery processes."
      ]
    },
    {
      "name": "Black Mountain Systems",
      "url": "https://allvuesystems.com",
      "location": "San Diego, CA",
      "position": "Director, Professional Services Engineering",
      "startDate": "2016",
      "endDate": "2018",
      "highlights": [
        "Led multiple teams of Professional Services Engineers responsible for configuring and customizing Everest client deployments.",
        "Oversaw hiring, onboarding, and training programs focused on SQL, XSLT, XPath, and .NET.",
        "Established technical best practices across the Professional Services org, including code review standards and reusable solution patterns.",
        "Partnered directly with clients to gather requirements, shape implementation strategy, and guide them through key product customizations and feature adoption.",
        "Managed project resourcing across a portfolio of active client implementations, balancing new deployments, escalations, and cross-functional initiatives."
      ]
    },
    {
      "name": "Black Mountain Systems",
      "url": "https://allvuesystems.com",
      "location": "San Diego, CA",
      "position": "Senior Software Engineer, Everest Platform",
      "startDate": "2007",
      "endDate": "2016",
      "highlights": [
        "Co-designed and built a robust Front Office Platform (Everest) using .NET and SQL to support portfolio management, trading, and research workflows.",
        "Architected and maintained a plugin-based integration framework using a publisher/subscriber model for bi-directional data exchange.",
        "Developed core integration logic with XPath, XSLT, and XML for flexible data transformation and automation.",
        "Mentored engineers in building scalable, client-facing features and contributed to system architecture decisions as the company grew."
      ]
    }
  ],
  "projects": [
    {
      "name": "Everest Implementations",
      "description": "Implemented Everest for dozens of clients of all sizes across the alternative asset management industry, covering a wide range of asset types.",
      "highlights": [
        "Designed integrations for trading, accounting, reporting, and more, enabling clients to consolidate data across platforms.",
        "Helped transition clients from legacy integrations to modern API/S3-based delivery, improving reliability and performance.",
        "Acted as a trusted advisor to clients on Everest configuration best practices, troubleshooting, and extension patterns."
      ]
    }
  ]
}
