{
    "basics": {
        "name": "Matt Richards",
        "label": "Technical Leader | Senior Software Engineer | Data & Integrations",
        "email": "mtrichards26@gmail.com",
        "telephone": "",
        "summary": "Experienced software engineer and technical leader with a strong background in building scalable data platforms, integrations, and API-driven systems. Passionate about hands-on engineering, system design, and enabling teams to deliver reliable, maintainable software. Comfortable contributing at both the IC and manager level across the full software development lifecycle.",
        "location": {
            "postalCode": "92130",
            "city": "San Diego",
            "region": "CA"
        }
    },
    "skills": [
        {
            "name": "Languages",
            "level": "Proficient",
            "keywords": [
                "C#/.NET",
                "TypeScript",
                "JavaScript",
                "Node.js",
                "HTML",
                "SQL",
                "XSLT"
            ]
        },
        {
            "name": "Languages",
            "level": "Familiar",
            "keywords": [
                "Python",
                "PHP",
                "Java/Groovy",
                "Visual Basic"
            ]
        },
        {
            "name": "Software",
            "level": "Database",
            "keywords": [
                "SQL Server",
                "Snowflake",
                "MongoDB",
                "Oracle",
                "MySQL"
            ]
        },
        {
            "name": "Software",
            "level": "Cloud",
            "keywords": [
                "AWS","Azure"
            ]
        },
        {
            "name": "Software",
            "level": "Dev Tools",
            "keywords": [
                "Visual Studio",
                "Visual Studio Code",
                "Git",
                "Subversion"
            ]
        },
        {
            "name": "Software",
            "level": "Queue/Streaming",
            "keywords": [
                "RabbitMQ",
                "Kafka",
                "IBM MQ"
            ]
        },
        {
            "name": "Software",
            "level": "CI/CD",
            "keywords": [
                "Azure DevOps",
                "Team City"
            ]
        }
    ],
    "education": [
        {
            "institution": "University of California San Diego",
            "url": "https://ucsd.edu",
            "area": "Political Science: Internal Relations",
            "studyType": "Bachelor of Arts",
            "endDate": "1999"
        }
    ],
    "work": [
        {
            "name": "Allvue Systems",
            "url": "https://allvuesystems.com",
            "startDate": "2020",
            "position": "Director, Data Engineering / Senior Principal Architect",
            "highlights": [
                "Oversaw a cross-functional organization of 30+ engineers, data scientists, and analysts across four teams delivering core data platform and analytics capabilities.",
                "Led the architecture and delivery of a multi-tenant data platform serving 60+ enterprise clients and processing millions of records daily, built on Snowflake, Kafka, TypeScript, and .NET.",
                "Designed and built the initial prototype of the data platform to demonstrate feasibility and establish foundational patterns.",
                "Mentored engineers and managers across teams to help grow leadership skills, improve technical judgment, and build healthy engineering culture.",
                "Established engineering standards, architectural practices, and a strong code review culture across the data organization.",
                "Defined roadmaps and technical strategy in partnership with client, product, and executive stakeholders."
            ]
        },
        {
            "name": "Allvue Systems",
            "url": "https://allvuesystems.com",
            "startDate": "2018",
            "endDate": "2020",
            "position": "Director, Ops Engineering / Architect",
            "highlights": [
                "Led a team focused on enabling product engineering teams to deploy, manage, and integrate applications through CI/CD pipelines and internal tooling.",
                "Designed and built internal tools that streamlined onboarding, improved incident response, and automated key operational workflows across the engineering org.",
                "Deployed and maintained an enterprise-wide telemetry and monitoring solution, supporting consistent observability practices across teams.",
                "Led a successful org-wide migration to Azure DevOps and Jira, consolidating disparate systems and standardizing build and task tracking processes."
            ]
        },
        {
            "name": "Black Mountain Systems",
            "url": "https://allvuesystems.com",
            "startDate": "2016",
            "endDate": "2018",
            "position": "Director Professional Services Engineering",
            "highlights": [
                "Led multiple teams of Professional Services Engineers responsible for configuring and customizing client deployments of Allvue’s Front Office platform.",
                "Oversaw hiring, onboarding, and training programs for new engineers focused on SQL, XSLT, XPATH, and .NET, including curriculum development and mentorship processes.",
                "Established and enforced technical best practices across the Professional Services team, introducing code review standards and reusable solution patterns that improved maintainability and consistency.",
                "Collaborated directly with clients to gather requirements, shape implementation strategy, and guide them through key product customizations and feature adoption.",
                "Managed project resourcing across a portfolio of active client implementations, balancing new deployments, escalations, and cross-functional initiatives."
            ]
        },
        {
            "name": "Black Mountain Systems",
            "url": "https://allvuesystems.com",
            "startDate": "2007",
            "endDate": "2016",
            "position": "Senior Software Engineer",
            "highlights": [
                "Co-designed and built a robust Front Office Platform using .NET and SQL to support portfolio management, trading, and research workflows.",
                "Architected and maintained a plugin-based integration framework using a publisher/subscriber model, enabling bi-directional data exchange across external systems.",
                "Developed core integration logic with XPath, XSLT, and XML for flexible data transformation and automation.",
                "Mentored engineers in building scalable, client-facing features and contributed to system architecture decisions as the company grew."
            ]
        },
        {
            "name": "Soapbox Mobile",
            "url": "",
            "startDate": "2006-07",
            "endDate": "2007-08",
            "position": "Senior Software Engineer",
            "highlights": [
                "Developed application modules using PHP, JavaScript, and Python with PostgreSQL and MySQL backends for both internal teams and external clients.",
                "Co-designed and implemented a scalable architecture for a high-volume SMS delivery platform with a rich client-facing web interface, supporting millions of messages per day."
            ]
        },
        {
            "name": "LPL Financial",
            "url": "https://lpl.com",
            "startDate": "2006-04",
            "endDate": "2006-07",
            "position": "Senior Software Engineer (Contract)",
            "highlights": [
                "Worked with a small team of engineers in migrating legacy financial applications to ASP.NET 2.0, improving maintainability and performance.",
                "Developed a reusable library of UI and backend components to standardize and accelerate development across internal web applications."
            ]
        },
        {
            "name": "Aviatech",
            "startDate": "2006-01",
            "endDate": "2006-03",
            "position": "Web Developer (Contract)",
            "highlights": [
                "Built application for new email/web-based marketing campaigns using .NET and SQL Server."
            ]
        },
        {
            "name": "SMS.ac",
            "startDate": "2005-09",
            "endDate": "2006-01",
            "position": "Software Architect"
        },
        {
            "name": "SMS.ac",
            "startDate": "2004-06",
            "endDate": "2005-09",
            "position": "Software Engineer",
            "highlights": [
                "Designed and developed high-traffic web applications in ASP.NET and VBScript, supporting over 200,000 daily users across 40+ load-balanced IIS servers.",
                "Served as Lead Engineer for the Registration and User Profiles systems, two of the platform’s most heavily used components.",
                "Drove major performance optimization efforts by implementing data caching and subdomain isolation strategies.",
                "Led code review practices and enforced comprehensive unit testing of all database access methods prior to release."
            ]
        },
        {
            "name": "mCentric SA",
            "location": "Madrid, Spain",
            "startDate": "2002-11",
            "endDate": "2004-02",
            "position": "Technical Lead"
        },
        {
            "name": "mCentric SA",
            "location": "Madrid, Spain",
            "startDate": "2000-11",
            "endDate": "2002-02",
            "position": "Support Technician",
            "highlights": [
                "Coordinated development and installation of new services in customer environments.",
                "Built Web and WAP applications using Java Server Pages running over an Oracle 8 back end.",
                "Integration and functionality testing of all applications before delivery to the customer.",
                "Basic maintenance of pre-production and development servers (Solaris 8) in customer facilities.",
                "Internal Infrastructure tasks including user creation, PC/Network maintenance. (Solaris and Windows)"
            ]
        }
    ]
}